insert into Paidalanushy
(aty, telefon, poshta, kupiyaSoz, rol)
values
(N'Гиззат Балдиров', N'87765332665', N'gizzatbaldirov@gmail.kz', N'giz123', N'Клиент'),
(N'Айдана Серік', N'87711817102', N'aidana@mail.kz', N'aid123', N'Клиент'),
(N'Нұржан Әлиев', N'87078234709', N'nurzhan@mail.kz', N'nur123', N'Клиент'),
(N'Аружан Ермекова', N'87014927154', N'aruzhan@mail.kz', N'aru123', N'Клиент'),
(N'Данияр Асқаров', N'87477247195', N'daniyar@mail.kz', N'dan123', N'Клиент'),
(N'Мадина Болат', N'87055665254', N'madina@mail.kz', N'mad123', N'Клиент'),
(N'Әлихан Нұрлан', N'87057814607', N'alikhan@mail.kz', N'ali123', N'Жаттықтырушы'),
(N'Алина Маратова', N'87761714712', N'alina@mail.kz', N'ali456', N'Жаттықтырушы'),
(N'Ерлан Қайрат', N'87071596435', N'erlan@mail.kz', N'erl123', N'Әкімші'),
(N'Руслан Саматов', N'87774282791', N'ruslan@mail.kz', N'rus123', N'Сервистік инженер');

insert into Abonement
(turi, bastaluKuni, ayaqtaluKuni, kuyi, paidalanushy_id)
values
(N'Айлық', '2026-10-01', '2026-10-31', N'Белсенді', 1),
(N'3 айлық', '2026-09-01', '2026-12-01', N'Белсенді', 2),
(N'Айлық', '2026-10-05', '2026-11-05', N'Белсенді', 3),
(N'Жылдық', '2026-01-01', '2027-01-01', N'Белсенді', 4),
(N'Айлық', '2026-09-01', '2026-10-01', N'Аяқталған', 5),
(N'6 айлық', '2026-07-01', '2027-01-01', N'Белсенді', 6);

insert into Trenazher
(atauy, turi, kuyi)
values
(N'Жүгіру жолы №1', N'Кардио', N'Бос'),
(N'Жүгіру жолы №2', N'Кардио', N'Бос'),
(N'Велотренажер №1', N'Кардио', N'Бос'),
(N'Жим тренажері', N'Күштік', N'Бос'),
(N'Аяқ тренажері', N'Күштік', N'Бос'),
(N'Гребля тренажері', N'Кардио', N'Жөндеуде'),
(N'Эллиптикалық тренажер', N'Кардио', N'Бос'),
(N'Турник', N'Күштік', N'Бос'),
(N'Смит машинасы', N'Күштік', N'Бос'),
(N'Кроссовер', N'Күштік', N'Жөндеуде');

insert into VirtualdyKezek
(uaqyt, kezekNomiri, kuyi, paidalanushy_id, trenazher_id)
values
('2026-10-07T10:00:00', 1, N'Күтуде', 1, 1),
('2026-10-07T10:30:00', 2, N'Күтуде', 2, 1),
('2026-10-07T11:00:00', 1, N'Күтуде', 3, 4),
('2026-10-07T12:00:00', 1, N'Аяқталды', 4, 5),
('2026-10-07T13:30:00', 1, N'Күтуде', 5, 3),
('2026-10-07T14:00:00', 1, N'Күтуде', 6, 9);

insert into AqauOtinimi
(sipattama, qurylganUaqyt, kuyi,
 paidalanushy_id, trenazher_id)
values
(N'Тренажер қосылмайды',
 '2026-10-06T10:20:00',
 N'Жөндеуде', 1, 6),

(N'Дыбыс шығып тұр',
 '2026-10-06T12:30:00',
 N'Қабылданды', 2, 10),

(N'Экран жұмыс істемейді',
 '2026-10-07T09:15:00',
 N'Жаңа', 3, 2),

(N'Жылдамдық батырмасы жұмыс істемейді',
 '2026-10-07T11:40:00',
 N'Жаңа', 5, 1);

INSERT INTO Paidalanushy
(aty, telefon, poshta, kupiyaSoz, rol)
VALUES
(N'Асхат Болатов', N'87475843145', N'askhat@mail.kz', N'bol123', N'Клиент'),
(N'Жанат Жеткенова', N'87072618152', N'janat@mail.kz', N'jan123', N'Клиент'),
(N'Ермек Дәулет', N'87051837909', N'ermek@mail.kz', N'erm123', N'Клиент'),
(N'Ерасыл Ниетов', N'87749434594', N'erasyl@mail.kz', N'era123', N'Клиент'),
(N'Аслан Айбек', N'87067827146', N'aslan@mail.kz', N'asl123', N'Клиент')

INSERT INTO Abonement
(turi, bastaluKuni, ayaqtaluKuni, kuyi, paidalanushy_id)
VALUES
(N'Жылдық', '2026-06-10', '2027-06-10', N'Белсенді', 11),
(N'Айлық', '2026-09-03', '2026-10-03', N'Аяқталған', 14),
(N'6 айлық', '2026-10-14', '2027-04-14', N'Белсенді', 13),
(N'3 айлық', '2026-05-27', '2026-08-27', N'Аяқталған', 15),
(N'Айлық', '2026-07-19', '2026-08-19', N'Аяқталған', 12)

insert into Tolem (somasy, tolemKuni, adis, kuyi, abonement_id) values
(15000, '2026-10-01 09:30:00', N'Карта', N'Төленді', 1),
(25000, '2026-10-02 10:15:00', N'Қолма-қол', N'Төленді', 2),
(45000, '2026-10-03 11:20:00', N'Kaspi QR', N'Төленді', 3),
(15000, '2026-10-04 12:00:00', N'Карта', N'Төленді', 4),
(85000, '2026-10-05 14:10:00', N'Kaspi QR', N'Төленді', 5),
(25000, '2026-10-06 15:30:00', N'Қолма-қол', N'Төленді', 6),
(10000, '2026-10-07 09:00:00', N'Карта', N'Төленді', 1),
(12000, '2026-10-08 10:45:00', N'Kaspi QR', N'Күтуде', 2),
(20000, '2026-10-09 13:20:00', N'Карта', N'Төленді', 3),
(15000, '2026-10-10 16:00:00', N'Қолма-қол', N'Күтуде', 4);

insert into JattyguSabagy (atauy, bastaluUaqyty, uzaqtygy, orynSany, jattyqtyrushy_id) values
(N'Йога', '2026-10-15 09:00:00', 60, 15, 7),
(N'Пилатес', '2026-10-15 11:00:00', 45, 12, 8),
(N'Фитнес аэробика', '2026-10-16 10:00:00', 60, 20, 7),
(N'Күштік жаттығу', '2026-10-16 14:00:00', 90, 10, 8),
(N'Кардио жаттығу', '2026-10-17 09:30:00', 45, 15, 7),
(N'Стретчинг', '2026-10-17 12:00:00', 60, 12, 8),
(N'Функционалдық жаттығу', '2026-10-18 10:00:00', 60, 15, 7),
(N'Зумба', '2026-10-18 17:00:00', 60, 20, 8),
(N'Кроссфит', '2026-10-19 15:00:00', 75, 10, 7),
(N'Топтық фитнес', '2026-10-20 18:00:00', 60, 18, 8);

insert into SabakkaJazylu (jazyluKuni, kuyi, paidalanushy_id, sabak_id) values
('2026-10-14 09:00:00', N'Тіркелді', 1, 1),
('2026-10-14 09:15:00', N'Тіркелді', 2, 2),
('2026-10-14 10:00:00', N'Тіркелді', 3, 3),
('2026-10-14 10:30:00', N'Тіркелді', 4, 4),
('2026-10-14 11:00:00', N'Тіркелді', 5, 5),
('2026-10-14 11:30:00', N'Тіркелді', 6, 6),
('2026-10-14 12:00:00', N'Тіркелді', 1, 7),
('2026-10-14 12:30:00', N'Тіркелді', 2, 8),
('2026-10-14 13:00:00', N'Бас тартты', 3, 9),
('2026-10-14 13:30:00', N'Тіркелді', 4, 10);

insert into VirtualdyKezek (uaqyt, kezekNomiri, kuyi, paidalanushy_id, trenazher_id) values
('2026-10-08T09:00:00', 1, N'Күтуде', 11, 2),
('2026-10-08T09:30:00', 2, N'Күтуде', 13, 2),
('2026-10-08T10:00:00', 1, N'Аяқталды', 14, 7),
('2026-10-08T11:00:00', 1, N'Күтуде', 15, 8),
('2026-10-08T12:30:00', 1, N'Күтуде', 12, 10);

insert into AqauOtinimi (sipattama, qurylganUaqyt, kuyi, paidalanushy_id, trenazher_id) values
(N'Тренажердің педалі дұрыс айналмайды', '2026-10-08T09:20:00', N'Жаңа', 1, 3),
(N'Құрылғының экраны жыпылықтайды', '2026-10-08T10:40:00', N'Қабылданды', 2, 4),
(N'Тренажердің тұтқасы босап қалған', '2026-10-08T11:15:00', N'Жөндеуде', 3, 5),
(N'Орындықтың биіктігі реттелмейді', '2026-10-08T13:00:00', N'Жаңа', 4, 7),
(N'Құрылғы жаттығу кезінде тоқтап қалады', '2026-10-08T15:30:00', N'Қабылданды', 5, 8);
