insert into Paidalanushy
(aty, telefon, poshta, kupiyaSoz, rol)
values
(N'Гиззат Балдиров', N'87765332665', N'gizzatbaldirov@gmail.kz', N'giz123', N'Клиент'),
(N'Айдана Серік', N'87711817102', N'aidana@mail.kz', N'aid123', N'Клиент'),
(N'Нұржан Әлиев', N'87078234709', N'nurzhan@mail.kz', N'nur123', N'Клиент'),
(N'Аружан Ермекова', N'87014927154', N'aruzhan@mail.kz', N'aru123', N'Клиент'),
(N'Данияр Асқаров', N'87477247195', N'daniyar@mail.kz', N'dan123', N'Клиент'),
(N'Мадина Болат', N'87055665254', N'madina@mail.kz', N'mad123', N'Клиент'),
(N'Әлихан Нұрлан', N'87057814607', N'alikhan@mail.kz', N'ali123', N'Жаттықтырушы'),
(N'Алина Маратова', N'87761714712', N'alina@mail.kz', N'ali456', N'Жаттықтырушы'),
(N'Ерлан Қайрат', N'87071596435', N'erlan@mail.kz', N'erl123', N'Әкімші'),
(N'Руслан Саматов', N'87774282791', N'ruslan@mail.kz', N'rus123', N'Сервистік инженер');
go

insert into Abonement
(turi, bastaluKuni, ayaqtaluKuni, kuyi, paidalanushy_id)
values
(N'Айлық', '2026-10-01', '2026-10-31', N'Белсенді', 1),
(N'3 айлық', '2026-09-01', '2026-12-01', N'Белсенді', 2),
(N'Айлық', '2026-10-05', '2026-11-05', N'Белсенді', 3),
(N'Жылдық', '2026-01-01', '2027-01-01', N'Белсенді', 4),
(N'Айлық', '2026-09-01', '2026-10-01', N'Аяқталған', 5),
(N'6 айлық', '2026-07-01', '2027-01-01', N'Белсенді', 6);
go

insert into Trenazher
(atauy, turi, kuyi)
values
(N'Жүгіру жолы №1', N'Кардио', N'Бос'),
(N'Жүгіру жолы №2', N'Кардио', N'Бос'),
(N'Велотренажер №1', N'Кардио', N'Бос'),
(N'Жим тренажері', N'Күштік', N'Бос'),
(N'Аяқ тренажері', N'Күштік', N'Бос'),
(N'Гребля тренажері', N'Кардио', N'Жөндеуде'),
(N'Эллиптикалық тренажер', N'Кардио', N'Бос'),
(N'Турник', N'Күштік', N'Бос'),
(N'Смит машинасы', N'Күштік', N'Бос'),
(N'Кроссовер', N'Күштік', N'Жөндеуде');


insert into VirtualdyKezek
(uaqyt, kezekNomiri, kuyi, paidalanushy_id, trenazher_id)
values
('2026-10-07T10:00:00', 1, N'Күтуде', 1, 1),
('2026-10-07T10:30:00', 2, N'Күтуде', 2, 1),
('2026-10-07T11:00:00', 1, N'Күтуде', 3, 4),
('2026-10-07T12:00:00', 1, N'Аяқталды', 4, 5),
('2026-10-07T13:30:00', 1, N'Күтуде', 5, 3),
('2026-10-07T14:00:00', 1, N'Күтуде', 6, 9);
go

insert into AqauOtinimi
(sipattama, qurylganUaqyt, kuyi,
 paidalanushy_id, trenazher_id)
values
(N'Тренажер қосылмайды',
 '2026-10-06T10:20:00',
 N'Жөндеуде', 1, 6),

(N'Дыбыс шығып тұр',
 '2026-10-06T12:30:00',
 N'Қабылданды', 2, 10),

(N'Экран жұмыс істемейді',
 '2026-10-07T09:15:00',
 N'Жаңа', 3, 2),

(N'Жылдамдық батырмасы жұмыс істемейді',
 '2026-10-07T11:40:00',
 N'Жаңа', 5, 1);
go
